# FailedDowngradeTeeToCross Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..FailedDowngradeTeeToCross Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
Failed to upgrade tee type to cross type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedDowngradeTeeToCross { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedDowngradeTeeToCross As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedDowngradeTeeToCross {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace